The following is the TF plan output for the newly added resources.
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.gitlab_vpc will be created
  + resource "aws_cloudwatch_log_group" "gitlab_vpc" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/vpc/azul-gitlab"
      + retention_in_days = 180
      + tags              = {
          + "Name"                = "azul-gitlab_vpc"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab_vpc"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + tags_all          = {
          + "Name"                = "azul-gitlab_vpc"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab_vpc"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
    }

  # aws_flow_log.gitlab will be created
  + resource "aws_flow_log" "gitlab" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name"                = "azul-gitlab"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + tags_all                 = {
          + "Name"                = "azul-gitlab"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-03aeb4a3542c7a5d3"
    }

  # aws_iam_policy.gitlab_vpc will be created
  + resource "aws_iam_policy" "gitlab_vpc" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "azul-gitlab_vpc"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "Name"                = "azul-gitlab_vpc"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab_vpc"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + tags_all  = {
          + "Name"                = "azul-gitlab_vpc"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab_vpc"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
    }

  # aws_iam_role.gitlab_vpc will be created
  + resource "aws_iam_role" "gitlab_vpc" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "azul-gitlab_vpc"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"                = "azul-gitlab_vpc"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab_vpc"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + tags_all              = {
          + "Name"                = "azul-gitlab_vpc"
          + "billing"             = "hca"
          + "component"           = "azul-gitlab_vpc"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.gitlab_vpc will be created
  + resource "aws_iam_role_policy_attachment" "gitlab_vpc" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "azul-gitlab_vpc"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions
if you run "terraform apply" now.

```